In [2]:
import numpy as np
from numpy import nan as NA#if we not import this use nan as np.nan

In [3]:
import pandas as pd

In [5]:
s1=pd.Series([1,2,3,4,5,NA])

In [6]:
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [7]:
s1.isnull()#return only null value true

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [8]:
s1[s1.isnull()]#return only true value

5   NaN
dtype: float64

In [9]:
s1.notnull()#return only fill value true

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [10]:
s1[s1.notnull()]#return only false value

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [11]:
s1[1]=NA

In [12]:
s1.isnull()

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [13]:
s1[3]=NA

In [14]:
s1.isnull()

0    False
1     True
2    False
3     True
4    False
5     True
dtype: bool

In [15]:
s1[s1.isnull()]

1   NaN
3   NaN
5   NaN
dtype: float64

In [16]:
s1.notnull()

0     True
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [17]:
s1[s1.notnull()]

0    1.0
2    3.0
4    5.0
dtype: float64

In [18]:
s1

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
5    NaN
dtype: float64

In [24]:
s2=s1.fillna(3.2)

In [26]:
s1=s2
s1

0    1.0
1    3.2
2    3.0
3    3.2
4    5.0
5    3.2
dtype: float64

In [81]:
s1=s1[s1.notnull()]
s1.index=[1,2,3,4,5,6]
s1

1    1.0
2    3.2
3    3.0
4    3.2
5    5.0
6    3.2
dtype: float64

In [31]:
s1.reset_index()

   index    0
0      0  1.0
1      1  3.2
2      2  3.0
3      3  3.2
4      4  5.0
5      5  3.2

In [34]:
s1.dropna()

0    1.0
1    3.2
2    3.0
3    3.2
4    5.0
5    3.2
dtype: float64

In [35]:
s2[2]=NA

In [38]:
s2

0    1.0
1    3.2
2    NaN
3    3.2
4    5.0
5    3.2
dtype: float64

In [36]:
s2.dropna()#not change s2 in memory

0    1.0
1    3.2
3    3.2
4    5.0
5    3.2
dtype: float64

In [37]:
s2

0    1.0
1    3.2
2    NaN
3    3.2
4    5.0
5    3.2
dtype: float64

In [39]:
s2.dropna(inplace=True)#change s2 in memory

In [40]:
s2

0    1.0
1    3.2
3    3.2
4    5.0
5    3.2
dtype: float64

In [41]:
from numpy import nan as NA

In [42]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [43]:
cleaned=data.dropna()#threshold see the value not see NA

In [44]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [45]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [46]:
#all means if all nan in row or column are present
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [47]:
#any means if any nan in row or column are present
data.dropna(how="any")

     0    1    2
0  1.0  6.5  3.0

In [48]:
data.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [51]:
data.dropna(thresh=2,how="all")

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [52]:
data.dropna(thresh=4,how="all")

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [54]:
data.dropna(axis=1,thresh=2,how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [55]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [56]:
df

          0         1         2
0  1.418853       NaN       NaN
1 -0.048241       NaN       NaN
2  0.304148       NaN -0.678150
3 -0.574582       NaN -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [57]:
df.fillna(0)

          0         1         2
0  1.418853  0.000000  0.000000
1 -0.048241  0.000000  0.000000
2  0.304148  0.000000 -0.678150
3 -0.574582  0.000000 -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [58]:
df.fillna(5)

          0         1         2
0  1.418853  5.000000  5.000000
1 -0.048241  5.000000  5.000000
2  0.304148  5.000000 -0.678150
3 -0.574582  5.000000 -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [59]:
df.fillna({1:1,2:2})

          0         1         2
0  1.418853  1.000000  2.000000
1 -0.048241  1.000000  2.000000
2  0.304148  1.000000 -0.678150
3 -0.574582  1.000000 -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [60]:
df.mean()

0    0.214144
1    0.370086
2   -0.775160
dtype: float64

In [61]:
df.fillna(df.mean())

          0         1         2
0  1.418853  0.370086 -0.775160
1 -0.048241  0.370086 -0.775160
2  0.304148  0.370086 -0.678150
3 -0.574582  0.370086 -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [62]:
df.fillna({1:df[1].mean(),2:df[2].mean()})

          0         1         2
0  1.418853  0.370086 -0.775160
1 -0.048241  0.370086 -0.775160
2  0.304148  0.370086 -0.678150
3 -0.574582  0.370086 -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [85]:
a=df.mean(axis=1)
a

0     4938.709427
1    23567.000000
2       -0.187001
3       -0.728048
4        0.062573
5       -0.342057
6        0.010467
dtype: float64

In [87]:
df[2][1]=NA

In [88]:
df[1][2]=NA

In [89]:
df

              0            1         2
0      1.418853  9876.000000       NaN
1  23567.000000          NaN       NaN
2      0.304148          NaN -0.678150
3     -0.574582          NaN -0.881513
4     -0.226893     1.979781 -1.565169
5     -0.392868    -0.348888 -0.284415
6      1.018589    -0.520634 -0.466553

In [98]:
a

0     4938.709427
1    23567.000000
2       -0.187001
3       -0.728048
4        0.062573
5       -0.342057
6        0.010467
dtype: float64

In [100]:
df.fillna(value=a,axis=0)

              0             1         2
0      1.418853   9876.000000 -0.187001
1  23567.000000  23567.000000 -0.187001
2      0.304148  23567.000000 -0.678150
3     -0.574582  23567.000000 -0.881513
4     -0.226893      1.979781 -1.565169
5     -0.392868     -0.348888 -0.284415
6      1.018589     -0.520634 -0.466553

In [67]:
df.fillna(method="bfill")#fill nan value backword because the  value after nan is -0.88 in 2 col and 
# 1.97 in col 1 so it fill nan with 1.97 in col 1 and fill -0.88 in col 2

          0         1         2
0  1.418853  1.979781 -0.678150
1 -0.048241  1.979781 -0.678150
2  0.304148  1.979781 -0.678150
3 -0.574582  1.979781 -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [68]:
df.fillna(method="ffill")#fill nan forward because the first value is nan so it fill nan value to nan

          0         1         2
0  1.418853       NaN       NaN
1 -0.048241       NaN       NaN
2  0.304148       NaN -0.678150
3 -0.574582       NaN -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [69]:
df

          0         1         2
0  1.418853       NaN       NaN
1 -0.048241       NaN       NaN
2  0.304148       NaN -0.678150
3 -0.574582       NaN -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [70]:
df.fillna(method="ffill",limit=1)

          0         1         2
0  1.418853       NaN       NaN
1 -0.048241       NaN       NaN
2  0.304148       NaN -0.678150
3 -0.574582       NaN -0.881513
4 -0.226893  1.979781 -1.565169
5 -0.392868 -0.348888 -0.284415
6  1.018589 -0.520634 -0.466553

In [71]:
df[0][1]=23567

In [72]:
df

              0         1         2
0      1.418853       NaN       NaN
1  23567.000000       NaN       NaN
2      0.304148       NaN -0.678150
3     -0.574582       NaN -0.881513
4     -0.226893  1.979781 -1.565169
5     -0.392868 -0.348888 -0.284415
6      1.018589 -0.520634 -0.466553

In [73]:
 df[1][0]=9876

In [74]:
df

              0            1         2
0      1.418853  9876.000000       NaN
1  23567.000000          NaN       NaN
2      0.304148          NaN -0.678150
3     -0.574582          NaN -0.881513
4     -0.226893     1.979781 -1.565169
5     -0.392868    -0.348888 -0.284415
6      1.018589    -0.520634 -0.466553

In [75]:
df.fillna(method="ffill",limit=2)#limit define how many nan value would be filled forwardly

              0            1         2
0      1.418853  9876.000000       NaN
1  23567.000000  9876.000000       NaN
2      0.304148  9876.000000 -0.678150
3     -0.574582          NaN -0.881513
4     -0.226893     1.979781 -1.565169
5     -0.392868    -0.348888 -0.284415
6      1.018589    -0.520634 -0.466553

In [76]:
df.fillna(method="bfill",limit=1)

              0            1         2
0      1.418853  9876.000000       NaN
1  23567.000000          NaN -0.678150
2      0.304148          NaN -0.678150
3     -0.574582     1.979781 -0.881513
4     -0.226893     1.979781 -1.565169
5     -0.392868    -0.348888 -0.284415
6      1.018589    -0.520634 -0.466553

In [101]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [102]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [104]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [105]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [106]:
data.drop_duplicates(['k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [113]:
 data.drop_duplicates(['k1', 'k2'], keep='last') #take last duplicate value

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [109]:
data1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon'
                              ,'astrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data1

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6      astrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [108]:
meat_to_animal = {  'bacon': 'cow',  'pulled pork': 'pig',  'pastrami': 'cow',  'corned beef': 'cow',
                  'honey ham': 'pig',  'nova lox': 'salmon' }
meat_to_animal

{'bacon': 'cow',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [111]:
data1["food"].str.upper()

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6        ASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [112]:
lowercased = data1['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6        astrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [114]:
a=lambda x:x.upper()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6        astrami
7      honey ham
8       nova lox
Name: food, dtype: object

# Apply map only work on series

In [115]:
a=lambda x:x.upper()
lowercased.map(a)

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6        ASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [116]:
a=lambda x:x.title()
lowercased.map(a)

0          Bacon
1    Pulled Pork
2          Bacon
3       Pastrami
4    Corned Beef
5          Bacon
6        Astrami
7      Honey Ham
8       Nova Lox
Name: food, dtype: object

In [117]:
a=lambda x:print("this-->",x)
lowercased.map(a)
#map perform the iteration

this--> bacon
this--> pulled pork
this--> bacon
this--> pastrami
this--> corned beef
this--> bacon
this--> astrami
this--> honey ham
this--> nova lox

0    None
1    None
2    None
3    None
4    None
5    None
6    None
7    None
8    None
Name: food, dtype: object

In [121]:
data1['animal']=lowercased.map(meat_to_animal)
data1

          food  ounces  animal
0        bacon     4.0     cow
1  pulled pork     3.0     pig
2        bacon    12.0     cow
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     cow
6      astrami     3.0     NaN
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [122]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [123]:
 data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [124]:
 data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [125]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [126]:
 data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [128]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [130]:
transform=lambda x:x[:4].upper()

In [131]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [132]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [133]:
data.index=data.index.map(transform)

In [134]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [136]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data.rename(index=str.title,columns=str.upper,inplace=True)

# 1_dec_2019

In [1]:
import pandas as pd

In [11]:
import numpy as np

#not replace inplace

In [5]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [6]:
data.replace([-999.0],np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [7]:
data.replace([-999.0,-1000.0],np.nan)#pass list for replace  value to nan

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [9]:
data.replace([-999.0,1.0],[200,600])#pass list for replace

0     600.0
1     200.0
2       2.0
3     200.0
4   -1000.0
5       3.0
dtype: float64

In [10]:
data.replace({-999.0:90,2.0:67})#pass dictionary for replace

0       1.0
1      90.0
2      67.0
3      90.0
4   -1000.0
5       3.0
dtype: float64

In [12]:
 data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])

In [13]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [18]:
transform=lambda x:x[:4].upper()
data.index.map(transform)#dont support inplace and not make changes inplace

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [22]:
transform1=lambda x,y:x[:4].lower(),y[:].uppw
data.index.map(transform1)

TypeError: <lambda>() missing 1 required positional argument: 'y'

In [19]:
data.index=data.index.map(transform)#to change inplace

In [20]:
data.index

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [24]:
data.rename(index=str.title,columns=str.upper)#not change inplace

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [25]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [26]:
data=data.rename(index=str.title,columns=str.upper)#change inplace

In [27]:
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [28]:
data.rename(index={"Ohio":"INDIANA"},columns={"THREE":"peekachuu"})#rename not change inplace

         ONE  TWO  peekachuu  FOUR
INDIANA    0    1          2     3
Colo       4    5          6     7
New        8    9         10    11

In [29]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]#deiscrete data
bins= [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
#cuts first parameter single value and second parameter interval
#(18,25),(25,35),(35,60),(60,100)
cats 
#( is for open,value not included
#] is  for close,value after is ecluded

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [36]:
ages = [20,25,27,37,61, 70,100,]#deiscrete data
bins= [18, 25, 35, 60, 100]
cats4 = pd.cut(bins, ages)
#cuts first parameter single value and second parameter interval
#(18,25),(25,35),(35,60),(60,100)
cats4

[NaN, (20.0, 25.0], (27.0, 37.0], (37.0, 61.0], (70.0, 100.0]]
Categories (6, interval[int64]): [(20, 25] < (25, 27] < (27, 37] < (37, 61] < (61, 70] < (70, 100]]

In [31]:
ages = [18,20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]#deiscrete data
bins= [18, 25, 35, 60, 100]
cats2 = pd.cut(ages, bins)
#cuts first parameter single value and second parameter interval
#(18,25),(25,35),(35,60),(60,100)
cats2

[NaN, (18.0, 25.0], (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [34]:
ages = [20, 22, 25, 27,35,101, 45, 41, 80]#deiscrete data
bins= [18, 25, 35, 60, 100]
cats3 = pd.cut(ages, bins)
#cuts first parameter single value and second parameter interval
#(18,25),(25,35),(35,60),(60,100)
cats3

[(18.0, 25.0], (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], (25.0, 35.0], NaN, (35.0, 60.0], (35.0, 60.0], (60.0, 100.0]]
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]